<script lang="ts">
    import Counter from "./lib/Counter.svelte";

    const datas = [
        "क्या बात करें तेरे आँखों की\nएक जेल है बिन सलाखों की",
        "मेरे दामन में काटों के सिवा कुछ भी नहीं\nआप फूलों के खरीदार नजर आते हैं",
        "हर घूंट में तेरी यादें बसीं हैं\nकेसे कह दूँ, शराब कड़वी है",
        "बेच दूँ क्या सारी परेशानियां?\nमौत अछा दाम दे रहीं है",
        "थोड़ा इंतजार तो कर लेते\nदिल नहीं, मेरे दिन खराब थे",
        "तुमारी याद, जेसे बारिश की वो बूँद,\nजो मेहसूस तो होती है,\nपर पकड़ने पर अपना अस्तित्व खो देती है",
        "पानी मे तेरा अक्स देख कर इतरा रहा था मैं,\nकिसी ने पत्थर फेंककर, मंज़र बदल दिया",
        "मैं भी इतना पागल उस चाँद से इश्क कर बैठा,\nजिसके चाहने वाले आज तो क्या सदियों से अनेक हैं",
        "इन सितारों की महफिल मे\nऐ मेरे चाँद, तू खुद को अकेला मत मान,\nतेरे चाहने वाले अनेक हैं धरती पे",
        "पहले चाँद सिर्फ़ आसमान मे दिखता था,\nपर अब तुमारी आँखों मे भी दिखाई देता है",
        "एक दफा देखने के बाद,\nएक दफा और देखने का मन करे,\nऐसा नशा हो तुम",
        "आज फिर देखा किसी ने हमें मुहब्बत भरी निगाहों से,\nआज फिर हमनें तुमारी खातिर अपनी नजरें झुका ली",
        "तुम्हारा इक नजर मुझे यूँ देखना, \nमानो उस शराब के प्याले की तरह है,\nजिसे पीकर जिंदगी के सारे ग़म भुला बैठता हूँ",
        "साथ बैठकर तुमसे प्यार हो या ना हो,\nपर बातें काफी सारी हो जाएंगी",
        "तेरा गया कुछ नहीं, मेरा रहा कुछ नहीं,\nइश्क तुमसे यूँ कुछ इस तरह का हुआ",
        "काला होकर भी धन्य है वो काजल,\nजो तुमारी आँखों को और भी हसीन बना देता है",
        "ना जाने कौन सा जादू है तेरी ईन आँखों मे,\nएक यथार्थ व्यक्ती को भी शायर बना दिया",
        "तुम्हें हक से पाने की बहुत कामना है,\nपर कमबख्त ये हाथ की लकीरें साथ नहीं देंगी",
        "आँखों से आंसू छलक जायेंगे कहीं एकांत मे,\nतू बे फ़िक्र रह,\nतुझसे जब भी मिलेंगे, मुस्करा कर मिलेंगे",
        "आज आसमान मे चाँद नहीं दिखाई दिया,\nपर हमें क्या, हमने तुम्हारा चेहरा देख लिया",
        "तुम चाँद सितारे तोड़ने की उम्मीद करते रह गए,\nहम अपनी साँसों की माला पर तुम्हारा नाम सिल लिए",
        "मेरी शायरी तुम्हारे आने से ही जन्मी है,\nऔर मेरी ख्वाहिश है इसकी साँसें भी,\nतुम्हारे जाने के साथ ही निकल जायें",
        "तुमसे यूँ बातें ना करना,\nकिसी ख़फ़ा से कम नहीं\nबातें ही इस कदर हो चुकी हैं,\nकि तुम किसी मुस्तफा से कम नहीं",
        "आज आसमान मे चाँद नहीं दिखाई दिया,\nपर हमें क्  या, हमने तुम्हारा चेहरा देख लिया",
        "तुम चाँद सितारे तोड़ने की उम्मीद करते रह गए,\nहम अपनी साँसों की माला पर तुम्हारा नाम सिल लिए",
        "अकेला चलना कोई गुनाह नहीं है\nपर तुम्हारे वगैर चलना, ये गुनाह है",
        "तुम्हारे लब्ज बिना तुम्हारे बोले भी सुनाई दे जाते हैं\nबस तुम्हारी कमी तुम्हारे बेगार पूरी नहीं होती",
        "एक भूल खुदा से हुई, उसने तुम्हें मुझसे मिला दिया,\nएक भूल मुझसे हुई, मैं तुम्हें अपना ना बना सका",
        "ये ब्रह्मण भी छोटा लगने लगे\nतेरी आँखों की गहराई के आगे",
        "तू एक खुली किताब है,\nजिसे पढ़ना काफी आसान है\nजो तेरे चेहरे पर होता है,\nवही तेरे मन मे भी बस्ता है",
        "रातों में जागना फिर से शुरू हो गया है,\nलगता है हमें फिर से प्यार हो चुका है",
        "तुम्हारी आँखों से बहने वाले अश्रु,\nहमें गंगाजल से ज्यादा कीमती हैं",
        "किस्मत को है ये मंजूर क्या कीजिए,\nदुखद है, आप हमारी ताक में न बैठिए",
        "जिंदगी जीने के दायरे काफी छोटे हैं मेरे,\nएक बार फिर सोच, मेरा  हाथ थामने से पहले",
        "बसंत का महीना आ रहा है,\nचारो तरफ फूल खिलेंगे,\nकुछ हमारे बाघों मे,\nकुछ लोगों के दिलों मे",
        "चलो चाँद के पार चलते हैं,\nवही एक आशियाना बसाते हैं",
        "कच्ची उम्र में किये हुए वादे,\nहमें आज भी किसी और का नहीं होने देते",
        "वह नीम का पेड़ भी मीठा सा लगने लगा है,\nजब से मधुमक्खियों ने उस पर अपना घर बसाया है",
        "शराब पीने का क्या फायदा,\nसुबह तक सब उतर जाएगी,\nहमें तो तुम्हारी नजरों का सेवन करना है, \nकसम से, सारी उम्र ही नशे में निकल जाएगी",
        "दो शहरों के दो अंजान लोगो\nके बीच प्रेम का पुल बनने जा रहा है,\nलगता है उन दो शहरों के बीच\nकी दूरी कम होने वाली है",
        "दोस्तों में चर्चा नशे की हो रही थी\nमैं जिक्र तुम्हारी आँखों का कर आया",
        "तुमसे दूरी भी है,\nतुमसे मोह भी है,\nना जाने कैसी ही मजबूरी है",
        "लोग पत्थरों मे भगवान ढूँढते हैं,\nऔर हम हर लड़की मे तुम्हारा चेहरा",
        "रोशनी के इन्तेज़ार में,\nअँधेरों से मुहब्बत कर बैठे",
        "जिससे बिना बोले भी बातें हो जाएं,\nवो मिठास हो तुम",
        "जिन्दा कल भी था, ज़िन्दा आज भी हूँ,\nफर्क़ सिर्फ इतना है,\nशरीर के साथ अब दिल भी ज़िन्दा हो गया",
        "मैं तो समझता था मेरे पास सिर्फ काटे हैं,\nताज्जुब है, तेरे आने से काटे भी फूल बन बैठे",
        "रंग भी होशियार हो गए हैं,\nलोगों की जिंदगियों से निकल कर,\nगुलाल तक ही सिमटकर रह गए हैं",
        "हर जगह रंग ही रंग बिखरा हुआ है,\nफिर भी लोगों की जिंदगियां बेरंग सी हैं",
        "मेरा प्रेम भले ही तुम तक नहीं पहुँच सकता,\nपर मेरी दुआएँ तुम्हारे हिस्से जरूर पहुँच जाएंगी",
        "मधुर व्यव्हार को भी कुछ\nलड़के प्रेम समझ लेते हैं",
        "मेरा ख़यालों का शहर,\nतेरे होने से ही आबाद है",
        "हम प्यार नहीं मोहब्बत करते हैं जनाब\nसादी नहीं, बेइंतहा वाली करते हैं जनाब",
        "इश्क इश्क होता है जनाब\nहर जगह दिल लगाने को इश्क नहीं कह्ते",
        "दुश्मनों से भी प्यार हो जाएगा\nजरा दोस्तों को आजमाई तो सही",
        "हमें तो नफरत हो गयी थी उस निर्दयी शहर से,\nपर क्या पता था वहाँ भी कोई अपना निकल आएगा",
        "छोटी सी हमारी नैया पर,\nएक नायाबी आ बैठी है,\nडर है हम कहीं खुद के साथ,\nनैया भी ना डुबो बैठें",
        "नायाब हो तुम ये हमें पता है\nहीरे की परख हर कोई नहीं समझता",
        "कौन सोया कौन जागा,\nयह रात सब ढक लेती है",
        "फिर वही बातें लेकर\nहम कुछ नयी शायरी लिखें,\nकिरदार भले ही वही हो\nपर अंदाज-ऐ-बयां कुछ नये",
        "लोग शराब पीकर भंड होते हैं,\nऔर हम तुमारी आँखें देखकर",
        "हमारे चले जाने के बाद,\nहमसे ज्यादा तुम्हारी आँखें दुःखी होंगी,\nक्योंकि रिश्ता तुमसे खत्म होगा,\nतुम्हारी आँखों से नहीं",
        "तू रख अपने पास अपनी बारिशें\nमैं रेत से अपनी प्यास भुजा लूँगा",
        "भले ही कितनी दूरियाँ आ जायें हमारे बीच,\nमेरी शायरी तुझे किसी और का होने नहीं देगी",
        "अक्सर लोग बोला करते हैं,\nलड़कियों की इज्जत करना सीखो,\nक्या पता उन्हें कितने नादान हैं हम,\nआप से तुम तक भी ना पहुंच पाए",
        "प्रेम की बारिश हो रही थी,\nसभी हँसो के जोड़े भीग रहे थे,\nऔर मैं छाता लिए खडा रह गया",
        "उसकी जरा सी आँखों की नमी,\nमेरा अहंकार तोड़ने के लिए काफी है",
        "अँधा प्यार नहीं होता,\nअँधा तो वह इंसान है\nजिसने कभी प्यार ही \nना किया हो",
        "हम तो सिर्फ तेरी आँखें पे फिदा थे,\nतुझ से मिलके तेरी रूह पे भी हो गये",
        "जिसे पाने की इच्छा थी,\nवो अकेला छोड़ गया,\nजिसे चाहकर भी ना पाने की इच्छा थी\nवह अपनों से भी ज्यादा खास हो गया",
        "भले ही तेरे जिस्म को ना छुआ हो कभी,\nपर तेरी रूह को जरूर छू गए होंगे हम",
        "शायद अब समझ आ गया होगा तुम्हें,\nबिना नशे के कैसे नशे करते हैं हम",
        "अधूरी कहानी थी वो\nकोरा काग़ज़ था मैं\nनदी किनारे बैठे हम दो\nपिघला सा जा रहा था मैं",
        "पानी मे लहरों की भाती\nमैं बहता चला गया\nतेरे प्यार मे कुछ इस कदर\nमैं पागल होता चला गया",
        "लहरें बहती जा रहीं थी\nवक़्त भी बीता जा रहा था\nतुम मुस्कुराए जा रहीं थी\nमैं मन ही मन खुश हुए जा रहा था",
        "सारी दुनिया की मुश्किलें एक तरफ़\nतेरे साथ बैठना, तुझे देखना एक तरफ",
        "शब्दों के बीच की ख़ाली जगह हूँ.\nमेरा मतलब कुछ भी नहीं,\nपर मैं नहीं तो इन शब्दों का \nमतलब कुछ भी नही",
        "सीधे लोगों की सिर्फ दुनिया ही नहीं लेती\nउनकी खुद की जिंदगी भी उनकी लेती है",
        "वक़्त आ गया है,\nहमें अपना सामान बाँध लेना चाहिए,\nये घर किसी और के नाम होने जा रहा है",
        "तुम ज़माना देख आओ\nमैं यहीं खडा हूँ",
        "खत्म हो गया सफर,\nआ चुकी नाव किनारे,\nफर्क़ सिर्फ इतना है\nशरीर वापस आया है,\nमगर मेरी आत्मा नहीं",
        "ऊँचाइयों पर उड़ने वाले पक्षी,\nछोटे छोटे पेड़ों से लगाव नहीं लगाते",
        "मेरे मन रूपी ग़म के प्याले में, \nआज मैंने थोड़ी सी शराब भर दी,\nडर है प्याला और ग़मगीन ना हो जाए",
        "चिंगारी लगाने वाले कभी\nआग नहीं भुजाया करते",
        "अकेलापन शराब से ज्यादा खतरनाक है,\nशराब केवल शरीर खत्म करती है\nअकेलापन आपकी आत्मा",
        "आज पुराने दोस्तों से मिला जाए\nचाँद, और नदी किनारे बैठा जाए",
        "शराब से माफ़ी माँगनी पड़ रही है,\nनादानी मे हमने उसकी आँखों को,\nइससे ज्यादा नशीली कह दिया था",
        "भले ही अब लौटकर आओ या ना आओ,\nशराब अब हमें ज्यादा नशीली लगने लगी है",
        "किसी ने बहुत सही कहा था मुझे,\nदोस्ती करना, पर कभी दिल ना लगाना",
        "अफसोस है हम इंजीनियर होकर भी,\nतुम्हारे दिल तक पहुँचने का पुल ना बना सकें",
        "मेरी बाँसुरी की हर एक धुन तुम्हें पुकारती है,\nउम्मीद है जल्द ही एक दिन वापस आओगे",
        "दुःख इस बात का नहीं,\nतुम किसी और के हो गए,\nदुःख इस बात का है,\nहम फिर से अकेले हो गए",
        "सुबह को तेरी जुल्फों ने शाम कर दिया\nशराब को तेरी आँखों ने\nऔर भी नशीला कर दिया",
        "वफादार सिर्फ कुत्ता नहीं होता\n" +
        "एक अधूरे प्यार में पड़ा आशिक भी होता है",
        "तेरी गली का सफर आज भी याद है मुझे,\nमेरा तेरे लिए इंतजार करना आज भी याद है मुझे",
        "समंदर अपनी गहराई का बखान कर रहा था,\nशायद वह पगला तुम्हारी आँखों से परिचित ना था",
        "तुमको पाना तो कभी था ही नहीं,\nबस तुमको चाहना मजबूरी बन गयी",
        "कभी नंगे पैर चलके देखो घास पर,\nउस सुकून को मेहसूस करके देखो तुम",
        "जरूरी नहीं तस्वीर तुम्हारी सिर्फ तुम्हारे पास हो,\nकभी झाँक के देखो आँखों में हमारी",
        "जहाँ प्रेम को जीना था\nवहाँ तन्हाई ने जन्म ले लिया",
        "भले ही तुम हम से बातें करो या ना करो,\nतुम्हारी तस्वीर से हम रोज गुफ़्तगू किया करते हैं",
        "फासले अब हमें मेहसूस होने लगे हैं,\nबेहतर है पहले ही दूरी बना ली जाये",
        "बहती नदी सा हूँ,\nकभी ना कभी समंदर\nमे जा मिलूंगा मैं",
        "बहुत अंदर तक जला चुकी हैं,\nवो शिकायतें जो तुमको कभी बयान नहीं की",
        "इतनी शायरी लिख डाली उसके लिए,\nफिर भी पूछती है क्या तुम्हें मुझसे प्यार है",
        "हम उसकी आँखों में ढूँढते ढूँढते,\nअपनी आँखों के ख्वाब भूल गए",
        "हमारी एक चीख ने भीड़ तो इकठ्ठी कर दी\nपर शायद हमारी पुकार तुम तक न पहुँच सकी",
        "उम्र तो बड़ती जा रही है,\nजीना अभी भी बाकी है",
        "वक़्त से पहले\nलोगों को बूढ़ा होते देखा है\nमैंने अपनी माँ को\nबूढ़ा होते देखा है",
        "सुना है पैसे से पूरी\nदुनिया खरीदी जा सकती है,\nतो बताओ तुम्हारा\nप्यार कितने में बिकेगा",
        "एक पल में नशेड़ी कहलाए जा सकते हैं,\nबस तुम्हारी आँखों में झाँकने की देर है",
        "चलो कहीं घूम कर आते हैं,\nतारों की नुमाइश देख कर आते हैं",
        "रूठ कर बैठीं हैं वो किताबें,\nजिनपर कभी जान छिड़कते थे,\nजब से पैसा कमाने लगे हैं,\nशायद ख़ुदगर्ज हो गये हैं हम",
        "फूल जैसे हम,\nपत्थर जैसे इंसानों\nके बीच आ दबे",
        "शान से चलते थे जिस रास्ते के शहंशाह थे,\nआज वही रास्ते पर मेहमान बनकर रह गये हैं",
        "अँधेरा अकेलापन कुछ के लिए डर है,\nऔर कुछ के लिए सुकून भरा वक़्त है",
        "होशवालों को खबर क्या\nबेखुदी क्या चीज़ है\nइश्क कीजिये फिर समझिये\nज़िन्दगी क्या चीज़ है",
        "वो आग जिसे भुजाने में महीनों लग गए\nतेरी आँखें उसे एक क्षण में भड़का गयी ",
        "पैसे खर्च करने पड़ें तो कर दो,\nमगर शब्द तभी खर्च करो,\nजब सुनने वाला हिंदी प्रेमी हो",
        "तुम इजाजत तो दो मुझे,\nईश्वर से खुद माँग लूँगा तुम्हें",
        "जरा पास आओ, हमे छू के देखना है\nतुम इंसान ही हो, या दिव्य फरिश्ता ?",
        "चार दिन का इश्क सम्भाला नहीं जाता,\nपूरी जिंदगी साथ बीतने का ख्वाब देखते हैं",
        "नशा अगर शराब का हो तो सही है,\nप्रेम का नशा जिंदगी तबाह कर देता है",
        "हमारी तरफ से अपनी नजरें हटा लो,\nथोड़ा वक्त्त तो हमें होश में जी लेने दो",
        "कुछ पैसे मैंने आज भी बचा कर रखें हैं,\nतुमसे बिछड़कर उन्हें शराब पर ख़र्चेगें",
        "होश बेख़बर से हुए उनके बेगार\nजिंदगी बेमतलब सी हुई उनके बेगार",
        "भले ही इंसान बदल जाते हों\nमैंने चाँद को बदलते नहीं देखा",
        "दिन धुंधला है, रात नशीली है,\nऐसी कहानी कुछ इस शहर की है",
        "तेरी आँखें हर उस शायरी से भरी है,\nजिसे हर शायर अपनी कलम से,\nउसे अमर कर देना चाहता है"
    ].reverse();
</script>

<main class="bg-zinc-800 h-screen">
    <div class="flex items-center p-3 px-4">
        <div
                class="text-white text-2xl text-left font-semibold tracking-wider "
                style="font-family: 'Caveat', cursive;"
        >
            Hindi Shayari
        </div>
        <div class="flex-1"></div>
        <a class="hover:bg-zinc-600 rounded-full h-8 w-8" href="https://github.com/apgapg" target="_blank">
            <i class="fab fa-github text-white text-2xl cursor-pointer "></i>
        </a>
        <div class="mx-2"></div>
        <a class="hover:bg-zinc-600 rounded-full h-8 w-8" href="https://twitter.com/ayushpgupta" target="_blank">
            <i class="fab fa-twitter text-white text-2xl cursor-pointer "></i>
        </a>


    </div>
    <div class=" bg-zinc-300 opacity-20 border-b"></div>
    <div class="flex flex-wrap justify-center gap-4 py-4 overflow-y-auto">
        {#each datas as data}
            <Counter data={data}/>
        {/each}
    </div>
</main>

<style>
    :root {
        font-family: -apple-system, BlinkMacSystemFont, "Segoe UI", Roboto, Oxygen,
        Ubuntu, Cantarell, "Open Sans", "Helvetica Neue", sans-serif;
        @apply bg-zinc-800;
    }

    main {
        text-align: center;
        margin: 0 auto;
    }

    h1 {
        color: #ff3e00;
        text-transform: uppercase;
        font-size: 4rem;
        font-weight: 100;
        line-height: 1.1;
        margin: 2rem auto;
        max-width: 14rem;
    }

    p {
        max-width: 14rem;
        margin: 1rem auto;
        line-height: 1.35;
    }

    @media (min-width: 480px) {
        h1 {
            max-width: none;
        }

        p {
            max-width: none;
        }
    }
</style>
