<script lang="ts">
    import Counter from "./lib/Counter.svelte";

    const datas = [
        "क्या बात करें तेरे आखों की\nएक जेल है बिन सलाखों की",
        "मेरे दामन में काटों के सिवा कुछ भी नहीं\nआप फूलों के खरीदार नजर आते हैं",
        "हर घूंट में तेरी यादें बसीं हैं\nकेसे कह दूँ, शराब कड़वी है",
        "बेच दूँ क्या सारी परेशानियां?\nमौत अछा दाम दे रहीं है",
        "थोड़ा इंतजार तो कर लेते\nदिल नहीं, मेरे दिन खराब थे",
        "तुमारी याद, जेसे बारिश की वो बूँद,\nजो मेहसूस तो होती है,\nपर पकड़ने पर अपना अस्तित्व खो देती है",
        "पानी मे तेरा अक्स देख कर इतरा रहा था मैं,\nकिसी ने पत्थर फेंककर, मंज़र बदल दिया",
        "मैं भी इतना पागल उस चाँद से इश्क कर बैठा,\nजिसके चाहने वाले आज तो क्या सदियों से अनेक हैं",
        "इन सितारों की महफिल मे\nऐ मेरे चाँद, तू खुद को अकेला मत मान,\nतेरे चाहने वाले अनेक हैं धरती पे",
        "पहले चाँद सिर्फ़ आसमान मे दिखता था,\nपर अब तुमारी आखों मे भी दिखाई देता है",
        "एक दफा देखने के बाद,\nएक दफा और देखने का मन करे,\nऐसा नशा हो तुम",
        "आज फिर देखा किसी ने हमें मुहब्बत भरी निगाहों से,\nआज फिर हमनें तुमारी खातिर अपनी नजरें झुका ली",
        "तुम्हारा इक नजर मुझे यूँ देखना, \nमानो उस शराब के प्याले की तरह है,\nजिसे पीकर जिंदगी के सारे ग़म भुला बैठता हूँ",
        "साथ बैठकर तुमसे प्यार हो या ना हो,\nपर बातें काफी सारी हो जाएंगी",
        "तेरा गया कुछ नहीं, मेरा रहा कुछ नहीं,\nइश्क तुमसे यूँ कुछ इस तरह का हुआ",
        "काला होकर भी धन्य है वो काजल,\nजो तुमारी आखों को और भी हसीन बना देता है",
        "ना जाने कौन सा जादू है तेरी ईन आखों मे,\nएक यथार्थ व्यक्ती को भी शायर बना दिया",
        "तुम्हें हक से पाने की बहुत कामना है,\nपर कमबख्त ये हाथ की लकीरें साथ नहीं देंगी",
        "आखों से आंसू छलक जायेंगे कहीं एकांत मे,\nतू बे फ़िक्र रह,\nतुझसे जब भी मिलेंगे, मुस्करा कर मिलेंगे",
        "आज आसमान मे चाँद नहीं दिखाई दिया,\nपर हमें क्या, हमने तुम्हारा चेहरा देख लिया",
        "तुम चाँद सितारे तोड़ने की उम्मीद करते रह गए,\nहम अपनी साँसों की माला पर तुम्हारा नाम सिल लिए",
        "मेरी शायरी तुम्हारे आने से ही जन्मी है,\nऔर मेरी ख्वाहिश है इसकी साँसें भी,\nतुम्हारे जाने के साथ ही निकल जायें",
        "तुमसे यूँ बातें ना करना,\nकिसी ख़फ़ा से कम नहीं\nबातें ही इस कदर हो चुकी हैं,\nकि तुम किसी मुस्तफा से कम नहीं",
        "आज आसमान मे चाँद नहीं दिखाई दिया,\nपर हमें क्  या, हमने तुम्हारा चेहरा देख लिया",
        "तुम चाँद सितारे तोड़ने की उम्मीद करते रह गए,\nहम अपनी साँसों की माला पर तुम्हारा नाम सिल लिए",
        "अकेला चलना कोई गुनाह नहीं है\nपर तुम्हारे वगैर चलना, ये गुनाह है",
        "तुम्हारे लब्ज बिना तुम्हारे बोले भी सुनाई दे जाते हैं\nबस तुम्हारी कमी तुम्हारे बेगार पूरी नहीं होती",
        "एक भूल खुदा से हुई, उसने तुम्हें मुझसे मिला दिया,\nएक भूल मुझसे हुई, मैं तुम्हें अपना ना बना सका",
        "ये ब्रह्मण भी छोटा लगने लगे\nतेरी आखों की गहराई के आगे",
        "तू एक खुली किताब है,\nजिसे पढ़ना काफी आसान है\nजो तेरे चेहरे पर होता है,\nवही तेरे मन मे भी बस्ता है",
        "रातों में जागना फिर से शुरू हो गया है,\nलगता है हमें फिर से प्यार हो चुका है",
        "तुम्हारी आखों से बहने वाले अश्रु,\nहमें गंगाजल से ज्यादा कीमती हैं",
        "किस्मत को है ये मंजूर क्या कीजिए,\nदुखद है, आप हमारी ताक में न बैठिए",
        "जिंदगी जीने के दायरे काफी छोटे हैं मेरे,\nएक बार फिर सोच, मेरा  हाथ थामने से पहले",
        "बसंत का महीना आ रहा है,\nचारो तरफ फूल खिलेंगे,\nकुछ हमारे बाघों मे,\nकुछ लोगों के दिलों मे",
        "चलो चाँद के पार चलते हैं,\nवही एक आशियाना बसाते हैं",
        "कच्ची उम्र में किये हुए वादे,\nहमें आज भी किसी और का नहीं होने देते",
        "वह नीम का पेड़ भी मीठा सा लगने लगा है,\nजब से मधुमक्खियों ने उस पर अपना घर बसाया है",
        "शराब पीने का क्या फायदा, सुबह तक सब उतर जाएगी,\nहमें तो तुम्हारी नजरों का सेवन करना है, \nकसम से, सारी उम्र ही नशे में निकल जाएगी",
        "दो शहरों के दो अंजान लोगो के बीच प्रेम का पुल बनने जा रहा है,\nलगता है उन दो शहरों के बीच की दूरी कम होने वाली है",
        "दोस्तों में चर्चा नशे की हो रही थी\nमैं जिक्र तुम्हारी आँखों का कर आया"
    ].reverse();
</script>

<main class="bg-zinc-800 h-screen">
    <div class="flex items-center p-3 px-4">
        <div
                class="text-white text-2xl text-left font-semibold tracking-wider "
                style="font-family: 'Caveat', cursive;"
        >
            Hindi Shayari
        </div>
        <div class="flex-1"></div>
        <a class="hover:bg-zinc-600 rounded-full h-8 w-8" href="https://github.com/apgapg" target="_blank">
            <i class="fab fa-github text-white text-2xl cursor-pointer "></i>
        </a>
        <div class="mx-2"></div>
        <a class="hover:bg-zinc-600 rounded-full h-8 w-8" href="https://twitter.com/ayushpgupta" target="_blank">
            <i class="fab fa-twitter text-white text-2xl cursor-pointer "></i>
        </a>


    </div>
    <div class=" bg-zinc-300 opacity-20 border-b"></div>
    <div class="flex flex-wrap justify-center gap-4 py-4 overflow-y-auto">
        {#each datas as data}
            <Counter data={data}/>
        {/each}
    </div>
</main>

<style>
    :root {
        font-family: -apple-system, BlinkMacSystemFont, "Segoe UI", Roboto, Oxygen,
        Ubuntu, Cantarell, "Open Sans", "Helvetica Neue", sans-serif;
        @apply bg-zinc-800;
    }

    main {
        text-align: center;
        margin: 0 auto;
    }

    h1 {
        color: #ff3e00;
        text-transform: uppercase;
        font-size: 4rem;
        font-weight: 100;
        line-height: 1.1;
        margin: 2rem auto;
        max-width: 14rem;
    }

    p {
        max-width: 14rem;
        margin: 1rem auto;
        line-height: 1.35;
    }

    @media (min-width: 480px) {
        h1 {
            max-width: none;
        }

        p {
            max-width: none;
        }
    }
</style>
